lib/tasks/dev.rake

SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
---
  task add_coins: :environment do
    show_spinner("Cadastrando moedas...") do

      coins = [
          {
              description: "Bitcoin",
              acronym: "BTC",
              url_image: "https://cdn-icons-png.flaticon.com/512/991/991959.png",
              #mining_type: MiningType.where(acronym: 'PoW') #Dá erro pois quando usa where, o active record recebe um array de elementos que possuem a consição passada, sendo que ele precisa receber somente um elemento.
              #mining_type: MiningType.where(acronym: 'PoW').first #Para corrigir o erro do comando anterior, pode ser indicado para pegar somente o primeiro elemento do array que retornou na pesquisa.
              #mining_type: MiningType.find(acronym: 'PoW') #Dessa forma ele retorna somente um elemento, mais dessa forma tamber dá erro, pois o find exige que seja informado o ID e não a sigla
              mining_type: MiningType.find_by(acronym: 'PoW') #Dessa forma ele permite encontrar pela sigla
          },
          {
              description: "Ethereum",
              acronym: "ETH",
              url_image: "https://assets.stickpng.com/images/5a7593f664538c292dec1bbe.png",
              mining_type: MiningType.all.sample
          },
          {
              description: "Dash",
              acronym: "DASH",
              url_image: "https://icons-for-free.com/iconfiles/png/512/dash-1324440144814589350.png",
              mining_type: MiningType.all.sample
          },
          {
              description: "Iota",
              acronym: "IOT",
              url_image: "https://coins.com.br/img/criptos/IOTA.png",
              mining_type: MiningType.all.sample
          },
          {
              description: "ZCash",
              acronym: "ZEC",
              url_image: "https://cdn-icons-png.flaticon.com/512/1418/1418194.png",
              mining_type: MiningType.all.sample

INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
---

      coins.each do |coin|
          #Se já existir esse elemento no banco de dados, ele não irá criar um novo, só irá criar se n tiver cadastrado o banco de dados
          Coin.find_or_create_by!(coin)

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2023-02-16 15:15:34.487290"], ["updated_at", "2023-02-16 15:15:34.487290"]]
---
  task add_mining_types: :environment do
    show_spinner("Cadastrando tipos de mineração...") do

      mining_types = [
        {
          description: "Proof of Work",
          acronym: "PoW"
        },
        {
          description: "Proof of Stake",
          acronym: "PoS"
        },
        {
          description: "Proof of Capacity",
          acronym: "PoC"
        }
      ]
      mining_types.each do |mining_type|
        #Se já existir esse elemento no banco de dados, ele não irá criar um novo, só irá criar se n tiver cadastrado o banco de dados
        MiningType.find_or_create_by!(mining_type)