Site/app/views/coins/_form.html.erb

SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"
---
    <%# form.select("mining_type_id", MiningType.all.collect {|m| [m.description, m.id]}, {include_blank: 'Selecione'})%>
    <%= form.select("mining_type_id", MiningType.all.pluck(:description, :id), { include_blank: 'Selecione' }, class:"form-select")  %>