Site/app/views/coins/index.html.erb


<h2><%= Coin.model_name.human(count: @coins.count) %></h2>
---
SELECT "coins".* FROM "coins"
SELECT COUNT(*) FROM "coins"