Site/app/controllers/coins_controller.rb

INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Bla"], ["acronym", "Bla"], ["url_image", ""], ["created_at", "2023-01-20 11:34:25.330472"], ["updated_at", "2023-01-20 11:34:25.330472"]]
---
  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save

UPDATE "coins" SET "mining_type_id" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["mining_type_id", 2], ["updated_at", "2023-02-16 17:56:51.103862"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)

SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"
---
    def set_mining_type_options
      #Variável de sessão
      @set_mining_type_options = MiningType.all.pluck(:description, :id)

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_coin
      @coin = Coin.find(params[:id])#Find retorna um único elemento.
    end